Improve POS UI and fix billing
